# Используем базовый образ с Python и устанавливаем зависимости
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы приложения в рабочую директорию
COPY main.py .
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Открываем порт 8000, который используется в вашем приложении
EXPOSE 5555

# Запускаем ваше приложение при старте контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "5555"]

